type FAQItem = {
  question: string;
  answer: string;
};

export const desktopHeaderPhrase = ['Асуулт', 'Хариулт'];
export const mobileHeaderPhrase = ['Асуулт', 'Хариулт'];
export const animate = {
  initial: {
    y: '100%',
    opacity: 0,
  },
  open: (i: number) => ({
    y: '0%',
    opacity: 2,
    transition: { duration: 1, delay: 0.1 * i, ease: [0.33, 1, 0.68, 1] },
  }),
};

export const faqData: FAQItem[] = [
  {
    question: 'PineBank ашиглан хэрхэн данс үүсгэх вэ?',
    answer:
      'Та бүртгэл үүсгэн автоматаар данс үүсгэх боломжтой. Бүртгэлээ баталгаажуулсны дараа та дансандаа мөнгө шилжүүлэх боломжтой.',
  },
  {
    question: 'Мөнгө илгээх & нэхэмжлэх',
    answer:
      'Гүйлгээ цэс > Харилцах данс сонгох > Гүйлгээний дүн оруулах > Илгээх товчийг дараарай. Гүйлгээ цэсийн баруун буланд байрлах Convo цэс > Сүүлд хийсэн гүйлгээнээс сонгох > Гүйлгээний дүн оруулах > Илгээх товчийг дараарай.',
  },
  {
    question: 'Банкны харилцагч болох насны доод хязгаар хэд вэ?',
    answer:
      'Бид одоогоор 18-с дээш насны иргэдэд банкны үйлчилгээг үзүүлж байна. Удахгүй хүүхдүүдэд зориулсан банкны үйлчилгээг нэвтрүүлэх болно.',
  },
  {
    question: 'Бүртгэлтэй и-мэйл хаягаа яаж шинэчлэх вэ?',
    answer:
      '-Хэрвээ та апп-руугаа нэвтрэн орж байгаа бол зүүн дээд буланд байрлах “Профайл” хэсгийн “Миний мэдээлэл” цэс рүү орж бүртгэлтэй и-мэйл хаягаа солих боломжтой',
  },
];
